Repository: lv7777/w3c_cors
Catalog: w3c_cors-level2.tmx
Source language: en_us
Languages: ja

source: Security requirements and considerations are listed throughout this specification.
ja: セキュリティ要求と考慮事項はこの仕様書を通じて述べられている。

source: Server-side applications are enabled to discover that an HTTP request was deemed a cross-origin request by the user agent, through the Origin header.
ja: サーバーサイドアプリケーションはOrigin ヘッダを通してHTTPリクエストがUAによるクロスオリジンリクエストと見なされるかどうかを判断できる。

source: Set the cross-origin request status to preflight complete.
ja: cross-origin request statusをpreflight completeに設定する。

source: Set when user credentials are to be excluded in the request and when cookies are to be ignored in its response.
ja: リクエスト内で user credentials が除外され、レスポンス内でクッキーが無視された場合にセットする

source: Set when a preflight request is required.
ja: プリフライト リクエストが必要な場合にセットする。

source: Set when redirects are not to be automatically followed.
ja: リダイレクト時に自動で追跡し ない場合にセットする。

source: Similarly to same origin requests, CORS API specifications are encouraged to properly limit headers, methods, and user credentials the author can set and get for requests that are cross-origin.
ja: same origin リクエストと同様に、CORS API 仕様書では cross-originリクエストで作成者が設定、取得できるヘッダ、メソッド、 user credentials を適切に制限することを推奨している。

source: Simple cross-origin requests generated outside this specification (such as cross-origin form submissions using GET or POST or cross-origin GET requests resulting from script elements) typically include user credentials, so resources conforming to this specification must always be prepared to expect simple cross-origin requests with credentials.
ja: この仕様以外の場所で生成される シンプルなクロスオリジンリクエストリクエスト(例えばGET や POST を使用したクロスオリジン間のフォームのポスト 、もしくは script要素で生成されたクロスオリジン間の GET リクエスト等) では大抵ユーザー資格情報が含まれている。そのため、この仕様に準拠したリソースは常に資格情報を持ったシンプルなクロスオリジンリクエストに備えなければならない。

source: Since browsers are based on a same origin security model and the policy outlined in this specification is intended for APIs used in browsers, it is expected that APIs that will utilize this policy will have to handle a same origin request that results in a redirect that is cross-origin in a special way.
ja: ブラウザがsame origin セキュリティモデルに基づいており、この仕様書で概説されているポリシーはAPIがブラウザで使用することを意図しているため、このポリシーを使用するAPIは特殊な方法でcross-originリダイレクトの結果生じた同一オリジンリクエストを適切に処理しなければならない。

source: Since the list of headers can be unbounded, simply returning supported headers from Access-Control-Allow-Headers can be enough.
ja: list of headerは無制限に値を取れるため、 Access-Control-Request-Headers で示されたメソッドを返すだけで十分です。

source: Since the list of methods can be unbounded, simply returning the method indicated by Access-Control-Request-Method (if supported) can be enough.
ja: Since the list of methodsは無制限に値を取れるため、 Access-Control-Request-Method （サポートされている場合）で示されたメソッドを返すだけで十分です。

source: Some terminology in this specification is from The Web Origin Concept, HTML,
ja: この仕様書内のいくつかの語はThe Web Origin Concept、 HTML、

source: Specifically it does not refer to proxy authentication or the Origin header.
ja: 特にこの語はプロキシ認証情報やOrigin ヘッダとは関係がない。

source: Specifications that enable an API to make cross-origin requests to resources can use the algorithms defined by this specification.
ja: リソースを取得するクロスオリジンリクエストを作成することができるAPIを定義している仕様書では、この仕様書で定義されているアルゴリズムを使用することができます。

source: Status of this Document
ja: この文書の位置付け

source: Terminology is generally defined throughout the specification.
ja: 用語は大抵仕様所以外の場所で定義されている。

source: That is, make sure that the host name provided by that header matches the host name of the server on which the resource resides.
ja: これはつまり、このヘッダから提供されるホスト名がリソースが提供されているサーバーのホスト名とマッチするか確認する作業である。

source: The CORS wiki page provides more background information about this document.
ja: CORS wiki page ではこのドキュメントのより裏側の情報を提供している。

source: The URL to be fetched.
ja: fetchedするためのURL 。

source: The cache and network error steps are not used here as this is about an actual network error.
ja: ここではcache and network error stepsは実際のネットワークエラーとしては使用されない。

source: The credentials field value is true and the omit credentials flag is unset, or it is false and the omit credentials flag is set.
ja: 資格情報フィールドの値がtrueであり、omit credentials flag が未設定、もしくはomit credentials flagがfalseであり、なおかつomit credentials flagが設定済みである。

source: The cross-origin request algorithm can be used by CORS API specifications who wish to allow cross-origin requests for the network APIs they define.
ja: cross-origin requestアルゴリズムは(アルゴリズムが)定義したネットワークAPIに対してクロスオリジンリクエストを許可するCORS API仕様を使用することができる。

source: The origin field value is a case-sensitive match for source origin.
ja: origin フィールドの値が source originに case-sensitive マッチした場合。

source: The origin of the request.
ja: リクエストの オリジン 。

source: The request URL could have been blacklisted by the user in some fashion.
ja: request URL はいくつかの方法でユーザーによってブラックリスト入りされている可能性がある。

source: The request URL is modified in face of redirects.
ja: request URL はリダイレクトされた場合、修正される。

source: The request URL.
ja: request URL。

source: The request method is a simple method and the force preflight flag is unset.
ja: リクエストメソッド がシンプルメソッド でforce preflight flag がセットされていない場合。

source: The resource processing model section details how resources are to use these headers in a response.
ja: resource processing model セクションではリソースがそれらのヘッダをレスポンス内でどのように使用するか説明する。

source: The source origin is the initial origin that user agents must use for the Origin header.
ja: source origin はUAがOrigin ヘッダに使用しなければならない初期のoriginである。

source: The source origin.
ja: source origin。

source: The url field value is a case-sensitive match for request URL.
ja: url フィールドの値が requestURLに case-sensitive マッチした場合。

source: The Access-Control-Max-Age header indicates how long the response can be cached, so that for subsequent requests, within the specified time, no preflight request has to be made.
ja: Access-Control-Max-Ageヘッダではどれだけの期間レスポンスをキャッシュさせるかを指示することができる。 それ以降のリクエストのために、指定された時間内なら、プリフライトリクエストを作成する必要はない。

source: The Origin header can only contain a single origin as the user agent will not follow redirects.
ja: Origin ヘッダにはUAがリダイレクトを追跡しない、単一のoriginのみ記述することができる。

source: The getResponseHeader() method of XMLHttpRequest will therefore not expose any header not indicated above.
ja: 従って、XMLHttpRequest のgetResponseHeader() メソッドは上記で指示していないどんなメソッドも公開することができない。

source: The Access-Control-Allow-Methods header indicates the methods that can be used in the actual request.
ja: Access-Control-Allow-Methodsヘッダでは実際のリクエストで使用することのできるメソッドを指定することができる。

source: The Access-Control-Allow-Credentials header indicates whether the response to request can be exposed when the omit credentials flag is unset.
ja: Access-Control-Allow-Credentials ヘッダは omit credentials flag がセットされていないときにリクエストのレスポンスを公開できるかどうかを支持するものである。

source: The Access-Control-Allow-Headers header indicates, as part of the response to a preflight request, which header field names can be used during the actual request.
ja: Access-Control-Allow-Headers ヘッダはpreflight requestのレスポンスの一部として、どのヘッダフィールド名が actual requestで使用できるかを指示したものである。

source: The Access-Control-Allow-Methods header indicates, as part of the response to a preflight request, which methods can be used during the actual request.
ja: Access-Control-Allow-Methods ヘッダはpreflight requestのレスポンスの一部として、どのメソッドが actual requestで使用できるかを指示したものである。

source: The Access-Control-Allow-Origin header indicates whether a resource can be shared based by returning the value of the Origin request header, "*", or "null" in the response.
ja: Access-Control-Allow-Origin ヘッダはレスポンス内の Origin リクエストヘッダの帰ってきた値 、もしくは"*"、もしくは "null"に基づきリソースが共有できるかどうか指示するものである。

source: The Access-Control-Expose-Headers header indicates which headers are safe to expose to the API of a CORS API specification.
ja: Access-Control-Expose-Headersヘッダはどのヘッダが安全にCORS API 仕様のAPIに公開されているかを指示するものである。

source: The Access-Control-Max-Age header indicates how long the results of a preflight request can be cached in a preflight result cache.
ja: Access-Control-Max-Age ヘッダはどれだけの時間preflight result cacheに preflight request の結果をキャッシュできるかを指示したものである。

source: The Access-Control-Request-Headers header indicates which headers will be used in the actual request as part of the preflight request.
ja: Access-Control-Request-Headers ヘッダはどのヘッダを actual request で使用するかを preflight requestで指示したものである。

source: The Access-Control-Request-Method header indicates which method will be used in the actual request as part of the preflight request.
ja: Access-Control-Request-Method ヘッダはどのメソッドを actual request で使用するかを preflight requestで指示したものである。

source: The Origin header indicates where the cross-origin request or preflight request originates from.
ja: Origin ヘッダは cross-origin request や preflight request がどこから生成されているかを指示するものである。

source: The cross-origin request algorithm takes the following parameters:
ja: cross-origin request アルゴリズムは以下の引数を取る:

source: The resource sharing check algorithm for a given resource is as follows:
ja: 与えられたリソースのリソース共有チェック アルゴリズムは以下の通りである。

source: The ABNF syntax used in this section is from HTTP/1.1.
ja: このセクションで使用されているABNFの構文は、HTTP / 1.1からです。

source: The English version of this specification is the only normative version.
ja: この仕様の英語版の仕様書のみが正規のバージョンとなる。

source: The URL <scheme> is not supported.
ja: URL <scheme> がサポートサポートされていない。

source: The XMLHttpRequest specification does this.
ja: XMLHttpRequest仕様書ではこれを行う。

source: The above algorithm also functions when the ASCII serialization of an origin is the string "null".
ja: オリジンのASCII serializationが文字列 "null"である場合、上記のアルゴリズムは関数でもある。

source: The complexity of invoking the additional preflight request is the task of the user agent.
ja: 追加のプリフライトリクエストを呼び出すのはUAが行う複雑なタスクである。

source: The contents of the response can be shared with the API, including headers that have not been filtered out.
ja: このAPIによって共有できるレスポンスのコンテンツは、フィルタリングされてないヘッダを含める。

source: The entity body for the request.
ja: リクエストのボディ。

source: The following request rules are to be observed while making the preflight request:
ja: 以下の request rules をpreflight requestを作成するまでの間監視しなければならない:

source: The method for the request.
ja: リクエストのメソッド。

source: The origin of the resource blacklisted.
ja: リソースのオリジンがブラックリストに入っている。

source: The origin of the resource is known to be part of an intranet.
ja: リソースのオリジンがイントラネットの一部である。

source: The primary key of an entry consists of all fields excluding the max-age field.
ja: エントリーの主キーはmax-age field以外のすべてのフィールドから構成される。

source: The processing models are not suitable for standalone use.
ja: この処理モデルは独立して使うには適していない。

source: The processing models in this sections need to be referenced by a CORS API specification that defines when the algorithm is invoked and how the return values are to be handled.
ja: simple cross-origin request has been definedこのセクションの処理モデルは、アルゴリズムがいつ呼び出されるか、および戻り値がどのように処理されるかを定義するCORS API仕様によって参照される必要がある。

source: The request is outside the scope of this specification.
ja: このリクエストはこの仕様書の範囲外となる。

source: The request itself can still be progressing.
ja: 要求自体はまだ進行中です。

source: The resource can be shared.
ja: リソースは共有することができる。

source: The resource cannot be shared.
ja: リソースを共有することできない。

source: The resource sharing policy described by this specification is bound to a particular resource.
ja: この仕様書で説明されているリソース共有ポリシーは特定のリソースに結びついている。

source: The resource still must protect itself against CSRF attacks, such as by requiring the inclusion of an unguessable token in the explicitly provided content of the request.
ja: リソースは依然としてリクエストを明示的に提供している推測可能なトークンを含んだコンテンツの要求などのCSRF攻撃から守らなければいけない。

source: The response to that request includes the following headers:
ja: このレスポンスには以下のヘッダが含まれている：

source: The response to the actual request can simply contain this header:
ja: 実際のリクエストのレスポンスには、以下のヘッダを含めることができる。

source: The response to the preflight request could have the following headers specified:
ja: プリフライトリクエストに対するレスポンスは、次のヘッダーを持つことができます：

source: The result of this request is stored in a preflight result cache.
ja: このリクエストの結果はpreflight result cacheにキャッシュされる。

source: The security properties of such resources are unaffected by user-agents conformant to this specification.
ja: このようなリソースのセキュリティのプロパティは、この仕様に準拠しているUAの影響を受けません。

source: The specification that defines the API that uses the policy is a CORS API specification.
ja: この仕様書はCORS API仕様書のポリシーを使用するAPIを定義する。

source: The steps below describe what user agents must do for a cross-origin request with preflight.
ja: このステップではUAはプリフライト付きcross-origin requestのために何をしなければならないかを以下に記述している:

source: The steps below describe what user agents must do for a simple cross-origin request:
ja: このステップではUAはsimple cross-origin requestのために何をしなければならないかを以下に記述している。:

source: The string "*" cannot be used for a resource that supports credentials.
ja: 文字列 "*" は 資格情報をサポートしているリソースに対して使用することができない。

source: The term cross-origin is used to mean non same origin.
ja: 語クロスオリジンは 同一オリジンではないという意味で使用される。

source: The term user credentials for the purposes of this specification means cookies, HTTP authentication, and client-side SSL certificates that would be sent based on the user agent's previous interactions with the origin.
ja: 語 ユーザー資格情報 はこの仕様書内ではUAがベースとなってオリジンとインタラクティブにやりとりされる前に送信される cookie、HTTP 認証、クライアント側SSL証明書の意味で使用される。

source: The user aborted the request.
ja: ユーザーがリクエストを中断した。

source: The user agent gets the request from an API, such as XMLHttpRequest, to perform a cross-origin request using the custom XMODIFY method from source origin http://example.org to http://blog.example/entries/hello-world.
ja: UAは source origin http://example.org から http://blog.example/entries/hello-worldへのカスタムメソッドXMODIFY を使ったクロスオリジンリクエストを送信するために、XMLHttpRequestなどのAPIからリクエストを取得する。

source: The user agent is about to make the actual request.
ja: UAはactual requestを作成しようとしている。

source: The user agent performs a preflight request using the OPTIONS method to http://blog.example/entries/hello-world and includes the Origin and Access-Control-Request-Method headers with the appropriate values.
ja: UAは適切な値を持つ Access-Control-Request-Method ヘッダと Origin を含み、OPTIONS メソッドを使ったpreflight request をhttp://blog.example/entries/hello-worldに送信する。

source: The user agent then performs the desired request using the XMODIFY method to http://blog.example/entries/hello-world as this was allowed by the resource.
ja: UAは XMODIFY メソッドを使用してリソースの共有が許可されているhttp://blog.example/entries/hello-worldに要求リクエストを送る。

source: The user agent validates that the value and origin of where the request originated match.
ja: ユーザー エージェントは通常、ネットワーク要求に同一生成元制限を適用します。

source: The values are:
ja: 以下の値のいずれかの:

source: The variables used in the generic set of steps are part of the algorithms that invoke these set of steps.
ja: 通常の一連のステップで使用されている変数はそのステップを呼び出しているアルゴリズムの一部である。

source: There is a cache match when there is a cache entry in the preflight result cache for which the following is true:
ja: 以下の条件のいずれかが真であるキャッシュエントリー内の、 preflight result cacheがある場合、cache matchとなる：

source: These restrictions prevent a client-side Web application running from one origin from obtaining data retrieved from another origin, and also limit unsafe HTTP requests that can be automatically launched toward destinations that differ from the running application's origin.
ja: これらの制限により、あるオリジンのクライアント側のウェブアプリケーションが別のオリジンのデータを取得するのを制限し、現在実行されているアプリケーションのオリジンとは異なる安全でないHTTPリクエストが自動的に発信されるのを制限する。

source: They are added and removed in such a way that there can never be duplicate items in the cache.
ja: キャッシュの中のアイテムが決して重複しない方法で追加したり削除することができる。

source: This W3C Recommendation of CORS was produced jointly by the Web Applications (WebApps) and Web Application Security (WebAppSec) Working Groups, and published by the WebAppSec Working Group.
ja: これは、Web Applications (WebApps)と Web Application Security (WebAppSec) Working Groups による WebAppSecによって公開されたCORS W3C Recommendationである。

source: This appendix is non-normative.
ja: この付録は非規定である。

source: This cache consists of a set of entries.
ja: このキャッシュはいくつかのエントリから構成されている。

source: This can be handled equivalently to how network error is handled.
ja: これはnetwork errorの処理と同じ方法で処理できます。

source: This can include the origin of the resource itself though be aware that requests to cross-origin resources can be redirected back to the resource.
ja: これには cross-origin リクエストのリソースがリソース自身にリダイレクトバックに気づくためにリソース自身の origin を含むことができる。

source: This document defines a mechanism to enable client-side cross-origin requests.
ja: このドキュメントではクロスオリジン・リクエストを有効にするためのメカニズムを定義します。

source: This document has been reviewed by W3C Members, by software developers, and by other W3C groups and interested parties, and is endorsed by the Director as a W3C Recommendation.
ja: この文書は、W3Cのメンバー、ソフトウェア開発者、および他のW3Cグループや利害関係者によって検討され、W3C勧告としてディレクターによって承認されている。

source: This document was produced by groups operating under the 5 February 2004 W3C Patent Policy.
ja: この文書は2004年2月6日のW3C特許ポリシーの下で活動するグループによって作成された。

source: This enhances the functionality and interoperability of the Web.
ja: これはウェブの機能と相互運用性を強化する。

source: This ensures that preflight requests that happened solely because of the force preflight flag are cached too.
ja: これにより、force preflight flagによって発生した preflight requestsもまたキャッシュされることを保証する。

source: This extension enables server-side applications to enforce limitations (e.g. returning nothing) on the cross-origin requests that they are willing to service.
ja: この拡張はサーバーサイドアプリケーションがクロスオリジンリクエスト上でサービスを行うかどうかの(何も返さない等の)制限を強制できる。

source: This has no effect on setting of user credentials.
ja: これはuser credentialsの設定には影響を与えない。

source: This is a request to a non same-origin URL that first needs to be authorized using either a preflight result cache entry or a preflight request.
ja: これは最初に preflight result cache エントリー、もしくはpreflight requestによる認証が必要な同一オリジンではないURLである。

source: This is again validated by the user agent.
ja: これは、再びユーザエージェントによって検証される。

source: This is because an origin is composed of only the scheme, hostname, and port.
ja: これはオリジンがスキームとホスト名とポートにより構成されているためである。

source: This is the actual request.
ja: これはactual requestである。

source: This section defines the syntax of the new headers this specification introduces.
ja: このセクションではこの仕様書で導入する新しいヘッダの構文を定義する。

source: This section describes the processing models that resources have to implement.
ja: このセクションでは、リソースが実装する必要がある処理モデルについて説明します。

source: This section describes the processing models that user agents have to implement.
ja: このセクションではUAが実装する必要のある処理モデルについて説明する。

source: This section describes the status of this document at the time of its publication.
ja: この節は、公開時点におけるこの文書のステータスについて説明する。

source: This section is non-normative.
ja: この節は規定ではない。

source: This section lists advice that did not fit anywhere else.
ja: このセクションではそれ以外のアドバイスをリスト化している。

source: This specification defines a resource sharing policy that cannot be implemented without an API that utilizes it.
ja: この仕様書ではこの仕様書を活用するAPI抜きでは実装できないリソース共有ポリシーを定義する。

source: This specification defines how to authorize an instance of an application from a foreign origin, executing in the user agent, to access the representation of the resource in an HTTP response.
ja: この仕様書ではどのようにHTTPレスポンスでリソースにアクセスするために自オリジン外のアプリケーションのインスタンスが認証されるかを定義する。

source: This specification extends this model in several ways:
ja: この仕様は、いくつかの方法でこのモデルを拡張します。

source: This specification is a building block for other specifications, so-called CORS API specifications, which define how this specification is used.
ja: この仕様は他の仕様書のビルディングブロックであり、この仕様がどのように使用されるかを定義する。CORS API と呼ばれる。

source: This specification is written for resource authors and user agents.
ja: この仕様はリソースの著者およびユーザ エージェントについて書かれている。

source: This substitution can expose additional attack surface in some cases, as a cross-site scripting vulnerability in the requesting origin can allow elevation of privileges against the requested resource when compared to a server-to-server back channel.
ja: この置換は、サーバー間のバックチャンネルと比較した場合、要求するオリジンがリクエストされたオリジンに対して権限を昇格させるXSS脆弱性、などのいくつかの場合において追加の攻撃する境界を露出することができてしまう。

source: This will provide protection against DNS rebinding attacks.
ja: これは、DNSリバインディング攻撃に対する保護を提供する。

source: To be clear, the method and header fields are mutually exclusive.
ja: 誤解の無いように言うと、method と header のフィールドは互いに排他的である。

source: To protect resources against cross-origin requests that could not originate from certain user agents before this specification existed a preflight request is made to ensure that the resource is aware of this specification.
ja: 特定の（この仕様書が存在する前の）UAから生成できないクロスオリジンリクエストに対してリソースを保護するため、リソースがこの仕様を認識していることを確認するためのプリフライト要求が行う。

source: To provide integrity protection of resource sharing policy statements usage of SSL/TLS is encouraged.
ja: リソース共有ポリシーの完全性の保護を提供するためにSSL/TLSの使用を推奨される。

source: Transparently follow the redirect while observing the set of request rules.
ja: 一連の 要求ルールを観察する間、透過的にリダイレクトに従う。

source: Upload progress events are only dispatched once the cross-origin request status is preflight complete.
ja: Upload progress events は cross-origin request status が preflight complete状態になった後にのみ発行される。

source: Use method request method, entity body request entity body, including the author request headers, and include user credentials if the omit credentials flag is unset.
ja: もし omit credentials flag が未設定の場合、 user credentials と author request headersを含む、 request entity bodyがエンティティボディのrequest methodを使用します

source: Use of user credentials in a cross-origin request is appropriate when:
ja: クロスオリジンリクエスト ユーザー資格情報を使用するのは次のような例の場合が適切である:

source: Used to determine the Referer header.
ja: Referer ヘッダを決定するために使用される。

source: User agents and resource authors may employ any algorithm to implement this specification, so long as the end result is indistinguishable from the result that would be obtained by the specification's algorithms.
ja: 仕様書のアルゴリズムから得られる結果が区別不能な場合に限り、UAとリソースの著者はこの仕様を実装するためのどんなアルゴリズムでも実装できる。(結果が同じならば別に仕様書のアルゴでなくてもよい。)

source: User agents are encouraged to apply security decisions on a generic level and not just to the resource sharing policy.
ja: UAは通常レベルのセキュリティ上の決定を適用することと、その決定はリソース共有ポリシーだけに適用しないことを推奨される。

source: User agents are encouraged to impose a limit on max-age so items cannot stay in the preflight result cache for unreasonable amounts of time.
ja: UAは preflight result cache を不当な長い時間にしてアイテムをキャッシュしないようにするためにmax-age に制限を課すことを推奨される。

source: User agents can discover via a preflight request whether a cross-origin resource is prepared to accept requests, using a non-simple method, from a given origin.
ja: UAはsimple methodではないメソッドを使用してpreflight requestを通じてクロスオリジンのリソースがそのアクセスを受け入れるかどうか判断できる。

source: User agents commonly apply same-origin restrictions to network requests.
ja: ユーザー エージェントは通常、ネットワーク要求に同一生成元制限を適用します。

source: User agents may clear cache entries before the time specified in the max-age field has passed.
ja: UAは max-age の指定された時間が過ぎ去る前に、キャッシュのエントリーをクリアすることができる。

source: User agents must filter out all response headers other than those that are a simple response header or of which the field name is an ASCII case-insensitive match for one of the values of the Access-Control-Expose-Headers headers (if any), before exposing response headers to APIs defined in CORS API specifications.
ja: UAはCORS API仕様書で定義されているAPIにさらす前に、ASCII case-insensitiveでフィールド名がAccess-Control-Expose-Headersマッチする、もしくはsimple response header以外の全てのレスポンスヘッダを除外しなければならない。

source: Using XMLHttpRequest a client-side Web application on http://hello-world.example can access this resource as follows:
ja: 以下のようにして XMLHttpRequest をクライアント側の Web application で使用し、 http://hello-world.example にアクセスすることができる:

source: Using XMLHttpRequest again and assuming the application were hosted at http://calendar.example/app the author could use the following ECMAScript snippet:
ja: アプリケーションのホストが http://calendar.example/app に置かれており、再度 XMLHttpRequest を使用すると想定したとき、作者は以下の ECMAScript のスニペットを使用できる:

source: W3C Recommendation 16 January 2014
ja: 2014年1月16日付W3C勧告
